#Є два списки, які наповнюються користувачем з клавіатури.
#Сформувати список, в якому будуть міститися унікальні значення першого відносно другого списку
#та навпаки без повторень. Роздрукувати підсумковий об'єкт на екран в прямій послідовності,
#зворотній, а також виконати сортування за зростанням та спаданням.

list1 = []
size = int(input("Сформируйте размер списка 1: "))
for i in range(size):
    list1.append(int(input("Введите номер для списка 1: ")))

list2 = []
size = int(input("Сформируйте размер списка 2: "))
for i in range(size):
    list2.append(int(input("Введите номер для списка 2: ")))

print("Ваш список 1 это:", list1)
print("Ваш список 2 это:", list2)

list3 = []
for i in list1:
    if (i not in list2) and (i not in list3):
        list3.append(i)
for j in list2:
    if (j not in list1) and (j not in list3):
        list3.append(j)

print("Уникальные значения для списков в прямой последовательности:", list3)
print("Уникальные значения для списков в обратной последовательности:", list3[::- 1])
list3.sort()
print("Сортировка списка по возростанию:", list3)
print("Сортировка списка по убыванию:", list3[::- 1])
